cases/baseCase_baselineHover/0/k
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 1e-06;

boundaryField
{
    ground
    {
        type  kqRWallFunction;
        value uniform 1e-06;
    }

    top
    {
        type       inletOutlet;
        inletValue uniform 1e-06;
        value      uniform 1e-06;
    }

    farField
    {
        type       inletOutlet;
        inletValue uniform 1e-06;
        value      uniform 1e-06;
    }
}
